export function TestRoutersecond() {
    return(
        <div>
Переписать веб приложение SPA на React-Redux, оптимизировать вёрстку для Material UI. ТЗ отлавливать ошибки и 
адекватно их отображать,отправлять на сервер сообщение об ошибке; модульность элементов страницы, что бы можно было 
их переиспользовать на разных страницах; производительность - красота не в ущерб производительности; главная таблица - 
сейчас ее прорисовка долгая, оптимизировать ее, возможность менять столбцы в таблице местами и менять количество
 отображаемых столбцов; уменьшить количество запросов к серверу при прорисовке страницы; мобильная адаптивность,
  возможно другая верстка для мобильных; в главной таблице заказов при множестве выборки заказов и взаимодействии с
   сервером делает в цикле запросы к серверу - переделать что бы отправляло одним масивом нужную информацию; должна
    быть возможность использовать вебсокеты; работа со Storage браузеров (сейчас у некоторых клиентов возникают ошибки при взаимодействии с ним);
 нормальная работа на разных браузерах и ОС (Apple); возможность управлять видимостью частей блока; подробнее в тг: a_grish 
        </div>
    )
}